MikroElektronika/core_packages/PIC/XC8/def/PIC16F19197/mcu.h
extern volatile LCDDATA8bits_t LCDDATA8bits __at(0x1D20);
// bitfield macros
#define _LCDDATA8_S16C1_POSN                                0x0
#define _LCDDATA8_S16C1_POSITION                            0x0
#define _LCDDATA8_S16C1_SIZE                                0x1
#define _LCDDATA8_S16C1_LENGTH                              0x1
#define _LCDDATA8_S16C1_MASK                                0x1
#define _LCDDATA8_S17C1_POSN                                0x1
#define _LCDDATA8_S17C1_POSITION                            0x1
#define _LCDDATA8_S17C1_SIZE                                0x1
#define _LCDDATA8_S17C1_LENGTH                              0x1
#define _LCDDATA8_S17C1_MASK                                0x2
#define _LCDDATA8_S18C1_POSN                                0x2
#define _LCDDATA8_S18C1_POSITION                            0x2
#define _LCDDATA8_S18C1_SIZE                                0x1
#define _LCDDATA8_S18C1_LENGTH                              0x1
#define _LCDDATA8_S18C1_MASK                                0x4
#define _LCDDATA8_S19C1_POSN                                0x3
#define _LCDDATA8_S19C1_POSITION                            0x3
#define _LCDDATA8_S19C1_SIZE                                0x1
#define _LCDDATA8_S19C1_LENGTH                              0x1
#define _LCDDATA8_S19C1_MASK                                0x8
#define _LCDDATA8_S20C1_POSN                                0x4
#define _LCDDATA8_S20C1_POSITION                            0x4
#define _LCDDATA8_S20C1_SIZE                                0x1
#define _LCDDATA8_S20C1_LENGTH                              0x1
#define _LCDDATA8_S20C1_MASK                                0x10
#define _LCDDATA8_S21C1_POSN                                0x5
#define _LCDDATA8_S21C1_POSITION                            0x5
#define _LCDDATA8_S21C1_SIZE                                0x1
#define _LCDDATA8_S21C1_LENGTH                              0x1
#define _LCDDATA8_S21C1_MASK                                0x20
#define _LCDDATA8_S22C1_POSN                                0x6
#define _LCDDATA8_S22C1_POSITION                            0x6
#define _LCDDATA8_S22C1_SIZE                                0x1
#define _LCDDATA8_S22C1_LENGTH                              0x1
#define _LCDDATA8_S22C1_MASK                                0x40
#define _LCDDATA8_S23C1_POSN                                0x7
#define _LCDDATA8_S23C1_POSITION                            0x7
#define _LCDDATA8_S23C1_SIZE                                0x1
#define _LCDDATA8_S23C1_LENGTH                              0x1
#define _LCDDATA8_S23C1_MASK                                0x80

// Register: LCDDATA9
#define LCDDATA9 LCDDATA9
extern volatile unsigned char           LCDDATA9            __at(0x1D21);
#ifndef _LIB_BUILD
asm("LCDDATA9 equ 01D21h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S24C1                  :1;
        unsigned S25C1                  :1;
        unsigned S26C1                  :1;
        unsigned S27C1                  :1;
        unsigned S28C1                  :1;
        unsigned S29C1                  :1;
        unsigned S30C1                  :1;
        unsigned S31C1                  :1;
    };
} LCDDATA9bits_t;
extern volatile LCDDATA9bits_t LCDDATA9bits __at(0x1D21);
// bitfield macros
#define _LCDDATA9_S24C1_POSN                                0x0
#define _LCDDATA9_S24C1_POSITION                            0x0
#define _LCDDATA9_S24C1_SIZE                                0x1
#define _LCDDATA9_S24C1_LENGTH                              0x1
#define _LCDDATA9_S24C1_MASK                                0x1
#define _LCDDATA9_S25C1_POSN                                0x1
#define _LCDDATA9_S25C1_POSITION                            0x1
#define _LCDDATA9_S25C1_SIZE                                0x1
#define _LCDDATA9_S25C1_LENGTH                              0x1
#define _LCDDATA9_S25C1_MASK                                0x2
#define _LCDDATA9_S26C1_POSN                                0x2
#define _LCDDATA9_S26C1_POSITION                            0x2
#define _LCDDATA9_S26C1_SIZE                                0x1
#define _LCDDATA9_S26C1_LENGTH                              0x1
#define _LCDDATA9_S26C1_MASK                                0x4
#define _LCDDATA9_S27C1_POSN                                0x3
#define _LCDDATA9_S27C1_POSITION                            0x3
#define _LCDDATA9_S27C1_SIZE                                0x1
#define _LCDDATA9_S27C1_LENGTH                              0x1
#define _LCDDATA9_S27C1_MASK                                0x8
#define _LCDDATA9_S28C1_POSN                                0x4
#define _LCDDATA9_S28C1_POSITION                            0x4
#define _LCDDATA9_S28C1_SIZE                                0x1
#define _LCDDATA9_S28C1_LENGTH                              0x1
#define _LCDDATA9_S28C1_MASK                                0x10
#define _LCDDATA9_S29C1_POSN                                0x5
#define _LCDDATA9_S29C1_POSITION                            0x5
#define _LCDDATA9_S29C1_SIZE                                0x1
#define _LCDDATA9_S29C1_LENGTH                              0x1
#define _LCDDATA9_S29C1_MASK                                0x20
#define _LCDDATA9_S30C1_POSN                                0x6
#define _LCDDATA9_S30C1_POSITION                            0x6
#define _LCDDATA9_S30C1_SIZE                                0x1
#define _LCDDATA9_S30C1_LENGTH                              0x1
#define _LCDDATA9_S30C1_MASK                                0x40
#define _LCDDATA9_S31C1_POSN                                0x7
#define _LCDDATA9_S31C1_POSITION                            0x7
#define _LCDDATA9_S31C1_SIZE                                0x1
#define _LCDDATA9_S31C1_LENGTH                              0x1
#define _LCDDATA9_S31C1_MASK                                0x80

// Register: LCDDATA10
#define LCDDATA10 LCDDATA10
extern volatile unsigned char           LCDDATA10           __at(0x1D22);
#ifndef _LIB_BUILD
asm("LCDDATA10 equ 01D22h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S32C1                  :1;
        unsigned S33C1                  :1;
        unsigned S34C1                  :1;
        unsigned S35C1                  :1;
        unsigned S36C1                  :1;
        unsigned S37C1                  :1;
        unsigned S38C1                  :1;
        unsigned S39C1                  :1;
    };
} LCDDATA10bits_t;
extern volatile LCDDATA10bits_t LCDDATA10bits __at(0x1D22);
// bitfield macros
#define _LCDDATA10_S32C1_POSN                               0x0
#define _LCDDATA10_S32C1_POSITION                           0x0
#define _LCDDATA10_S32C1_SIZE                               0x1
#define _LCDDATA10_S32C1_LENGTH                             0x1
#define _LCDDATA10_S32C1_MASK                               0x1
#define _LCDDATA10_S33C1_POSN                               0x1
#define _LCDDATA10_S33C1_POSITION                           0x1
#define _LCDDATA10_S33C1_SIZE                               0x1
#define _LCDDATA10_S33C1_LENGTH                             0x1
#define _LCDDATA10_S33C1_MASK                               0x2
#define _LCDDATA10_S34C1_POSN                               0x2
#define _LCDDATA10_S34C1_POSITION                           0x2
#define _LCDDATA10_S34C1_SIZE                               0x1
#define _LCDDATA10_S34C1_LENGTH                             0x1
#define _LCDDATA10_S34C1_MASK                               0x4
#define _LCDDATA10_S35C1_POSN                               0x3
#define _LCDDATA10_S35C1_POSITION                           0x3
#define _LCDDATA10_S35C1_SIZE                               0x1
#define _LCDDATA10_S35C1_LENGTH                             0x1
#define _LCDDATA10_S35C1_MASK                               0x8
#define _LCDDATA10_S36C1_POSN                               0x4
#define _LCDDATA10_S36C1_POSITION                           0x4
#define _LCDDATA10_S36C1_SIZE                               0x1
#define _LCDDATA10_S36C1_LENGTH                             0x1
#define _LCDDATA10_S36C1_MASK                               0x10
#define _LCDDATA10_S37C1_POSN                               0x5
#define _LCDDATA10_S37C1_POSITION                           0x5
#define _LCDDATA10_S37C1_SIZE                               0x1
#define _LCDDATA10_S37C1_LENGTH                             0x1
#define _LCDDATA10_S37C1_MASK                               0x20
#define _LCDDATA10_S38C1_POSN                               0x6
#define _LCDDATA10_S38C1_POSITION                           0x6
#define _LCDDATA10_S38C1_SIZE                               0x1
#define _LCDDATA10_S38C1_LENGTH                             0x1
#define _LCDDATA10_S38C1_MASK                               0x40
#define _LCDDATA10_S39C1_POSN                               0x7
#define _LCDDATA10_S39C1_POSITION                           0x7
#define _LCDDATA10_S39C1_SIZE                               0x1
#define _LCDDATA10_S39C1_LENGTH                             0x1
#define _LCDDATA10_S39C1_MASK                               0x80

// Register: LCDDATA11
#define LCDDATA11 LCDDATA11
extern volatile unsigned char           LCDDATA11           __at(0x1D23);
#ifndef _LIB_BUILD
asm("LCDDATA11 equ 01D23h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned S40C1                  :1;
        unsigned S41C1                  :1;
        unsigned S42C1                  :1;
        unsigned S43C1                  :1;
        unsigned S44C1                  :1;
        unsigned S45C1                  :1;
    };
} LCDDATA11bits_t;
