MikroElektronika/core_packages/PIC/XC8/def/PIC16F19197/mcu.h
extern volatile RH1PPSbits_t RH1PPSbits __at(0x1E49);
// bitfield macros
#define _RH1PPS_RH1PPS0_POSN                                0x0
#define _RH1PPS_RH1PPS0_POSITION                            0x0
#define _RH1PPS_RH1PPS0_SIZE                                0x1
#define _RH1PPS_RH1PPS0_LENGTH                              0x1
#define _RH1PPS_RH1PPS0_MASK                                0x1
#define _RH1PPS_RH1PPS1_POSN                                0x1
#define _RH1PPS_RH1PPS1_POSITION                            0x1
#define _RH1PPS_RH1PPS1_SIZE                                0x1
#define _RH1PPS_RH1PPS1_LENGTH                              0x1
#define _RH1PPS_RH1PPS1_MASK                                0x2
#define _RH1PPS_RH1PPS2_POSN                                0x2
#define _RH1PPS_RH1PPS2_POSITION                            0x2
#define _RH1PPS_RH1PPS2_SIZE                                0x1
#define _RH1PPS_RH1PPS2_LENGTH                              0x1
#define _RH1PPS_RH1PPS2_MASK                                0x4
#define _RH1PPS_RH1PPS3_POSN                                0x3
#define _RH1PPS_RH1PPS3_POSITION                            0x3
#define _RH1PPS_RH1PPS3_SIZE                                0x1
#define _RH1PPS_RH1PPS3_LENGTH                              0x1
#define _RH1PPS_RH1PPS3_MASK                                0x8
#define _RH1PPS_RH1PPS4_POSN                                0x4
#define _RH1PPS_RH1PPS4_POSITION                            0x4
#define _RH1PPS_RH1PPS4_SIZE                                0x1
#define _RH1PPS_RH1PPS4_LENGTH                              0x1
#define _RH1PPS_RH1PPS4_MASK                                0x10
#define _RH1PPS_RH1PPS5_POSN                                0x5
#define _RH1PPS_RH1PPS5_POSITION                            0x5
#define _RH1PPS_RH1PPS5_SIZE                                0x1
#define _RH1PPS_RH1PPS5_LENGTH                              0x1
#define _RH1PPS_RH1PPS5_MASK                                0x20

// Register: RH2PPS
#define RH2PPS RH2PPS
extern volatile unsigned char           RH2PPS              __at(0x1E4A);
#ifndef _LIB_BUILD
asm("RH2PPS equ 01E4Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH2PPS0                :1;
        unsigned RH2PPS1                :1;
        unsigned RH2PPS2                :1;
        unsigned RH2PPS3                :1;
        unsigned RH2PPS4                :1;
        unsigned RH2PPS5                :1;
    };
} RH2PPSbits_t;
extern volatile RH2PPSbits_t RH2PPSbits __at(0x1E4A);
// bitfield macros
#define _RH2PPS_RH2PPS0_POSN                                0x0
#define _RH2PPS_RH2PPS0_POSITION                            0x0
#define _RH2PPS_RH2PPS0_SIZE                                0x1
#define _RH2PPS_RH2PPS0_LENGTH                              0x1
#define _RH2PPS_RH2PPS0_MASK                                0x1
#define _RH2PPS_RH2PPS1_POSN                                0x1
#define _RH2PPS_RH2PPS1_POSITION                            0x1
#define _RH2PPS_RH2PPS1_SIZE                                0x1
#define _RH2PPS_RH2PPS1_LENGTH                              0x1
#define _RH2PPS_RH2PPS1_MASK                                0x2
#define _RH2PPS_RH2PPS2_POSN                                0x2
#define _RH2PPS_RH2PPS2_POSITION                            0x2
#define _RH2PPS_RH2PPS2_SIZE                                0x1
#define _RH2PPS_RH2PPS2_LENGTH                              0x1
#define _RH2PPS_RH2PPS2_MASK                                0x4
#define _RH2PPS_RH2PPS3_POSN                                0x3
#define _RH2PPS_RH2PPS3_POSITION                            0x3
#define _RH2PPS_RH2PPS3_SIZE                                0x1
#define _RH2PPS_RH2PPS3_LENGTH                              0x1
#define _RH2PPS_RH2PPS3_MASK                                0x8
#define _RH2PPS_RH2PPS4_POSN                                0x4
#define _RH2PPS_RH2PPS4_POSITION                            0x4
#define _RH2PPS_RH2PPS4_SIZE                                0x1
#define _RH2PPS_RH2PPS4_LENGTH                              0x1
#define _RH2PPS_RH2PPS4_MASK                                0x10
#define _RH2PPS_RH2PPS5_POSN                                0x5
#define _RH2PPS_RH2PPS5_POSITION                            0x5
#define _RH2PPS_RH2PPS5_SIZE                                0x1
#define _RH2PPS_RH2PPS5_LENGTH                              0x1
#define _RH2PPS_RH2PPS5_MASK                                0x20

// Register: RH3PPS
#define RH3PPS RH3PPS
extern volatile unsigned char           RH3PPS              __at(0x1E4B);
#ifndef _LIB_BUILD
asm("RH3PPS equ 01E4Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned RH3PPS0                :1;
        unsigned RH3PPS1                :1;
        unsigned RH3PPS2                :1;
        unsigned RH3PPS3                :1;
        unsigned RH3PPS4                :1;
        unsigned RH3PPS5                :1;
    };
} RH3PPSbits_t;
extern volatile RH3PPSbits_t RH3PPSbits __at(0x1E4B);
// bitfield macros
#define _RH3PPS_RH3PPS0_POSN                                0x0
#define _RH3PPS_RH3PPS0_POSITION                            0x0
#define _RH3PPS_RH3PPS0_SIZE                                0x1
#define _RH3PPS_RH3PPS0_LENGTH                              0x1
#define _RH3PPS_RH3PPS0_MASK                                0x1
#define _RH3PPS_RH3PPS1_POSN                                0x1
#define _RH3PPS_RH3PPS1_POSITION                            0x1
#define _RH3PPS_RH3PPS1_SIZE                                0x1
#define _RH3PPS_RH3PPS1_LENGTH                              0x1
#define _RH3PPS_RH3PPS1_MASK                                0x2
#define _RH3PPS_RH3PPS2_POSN                                0x2
#define _RH3PPS_RH3PPS2_POSITION                            0x2
#define _RH3PPS_RH3PPS2_SIZE                                0x1
#define _RH3PPS_RH3PPS2_LENGTH                              0x1
#define _RH3PPS_RH3PPS2_MASK                                0x4
#define _RH3PPS_RH3PPS3_POSN                                0x3
#define _RH3PPS_RH3PPS3_POSITION                            0x3
#define _RH3PPS_RH3PPS3_SIZE                                0x1
#define _RH3PPS_RH3PPS3_LENGTH                              0x1
#define _RH3PPS_RH3PPS3_MASK                                0x8
#define _RH3PPS_RH3PPS4_POSN                                0x4
#define _RH3PPS_RH3PPS4_POSITION                            0x4
#define _RH3PPS_RH3PPS4_SIZE                                0x1
#define _RH3PPS_RH3PPS4_LENGTH                              0x1
#define _RH3PPS_RH3PPS4_MASK                                0x10
#define _RH3PPS_RH3PPS5_POSN                                0x5
#define _RH3PPS_RH3PPS5_POSITION                            0x5
#define _RH3PPS_RH3PPS5_SIZE                                0x1
#define _RH3PPS_RH3PPS5_LENGTH                              0x1
#define _RH3PPS_RH3PPS5_MASK                                0x20

// Register: ANSELF
#define ANSELF ANSELF
extern volatile unsigned char           ANSELF              __at(0x1E50);
#ifndef _LIB_BUILD
asm("ANSELF equ 01E50h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ANSF0                  :1;
        unsigned ANSF1                  :1;
        unsigned ANSF2                  :1;
        unsigned ANSF3                  :1;
        unsigned ANSF4                  :1;
        unsigned ANSF5                  :1;
        unsigned ANSF6                  :1;
        unsigned ANSF7                  :1;
    };
} ANSELFbits_t;
extern volatile ANSELFbits_t ANSELFbits __at(0x1E50);
// bitfield macros
#define _ANSELF_ANSF0_POSN                                  0x0
#define _ANSELF_ANSF0_POSITION                              0x0
#define _ANSELF_ANSF0_SIZE                                  0x1
#define _ANSELF_ANSF0_LENGTH                                0x1
#define _ANSELF_ANSF0_MASK                                  0x1
#define _ANSELF_ANSF1_POSN                                  0x1
#define _ANSELF_ANSF1_POSITION                              0x1
#define _ANSELF_ANSF1_SIZE                                  0x1
#define _ANSELF_ANSF1_LENGTH                                0x1
#define _ANSELF_ANSF1_MASK                                  0x2
#define _ANSELF_ANSF2_POSN                                  0x2
#define _ANSELF_ANSF2_POSITION                              0x2
#define _ANSELF_ANSF2_SIZE                                  0x1
#define _ANSELF_ANSF2_LENGTH                                0x1
#define _ANSELF_ANSF2_MASK                                  0x4
#define _ANSELF_ANSF3_POSN                                  0x3
#define _ANSELF_ANSF3_POSITION                              0x3
#define _ANSELF_ANSF3_SIZE                                  0x1
#define _ANSELF_ANSF3_LENGTH                                0x1
#define _ANSELF_ANSF3_MASK                                  0x8
#define _ANSELF_ANSF4_POSN                                  0x4
#define _ANSELF_ANSF4_POSITION                              0x4
#define _ANSELF_ANSF4_SIZE                                  0x1
#define _ANSELF_ANSF4_LENGTH                                0x1
#define _ANSELF_ANSF4_MASK                                  0x10
#define _ANSELF_ANSF5_POSN                                  0x5
#define _ANSELF_ANSF5_POSITION                              0x5
#define _ANSELF_ANSF5_SIZE                                  0x1
#define _ANSELF_ANSF5_LENGTH                                0x1
#define _ANSELF_ANSF5_MASK                                  0x20
#define _ANSELF_ANSF6_POSN                                  0x6
#define _ANSELF_ANSF6_POSITION                              0x6
#define _ANSELF_ANSF6_SIZE                                  0x1
#define _ANSELF_ANSF6_LENGTH                                0x1
#define _ANSELF_ANSF6_MASK                                  0x40
#define _ANSELF_ANSF7_POSN                                  0x7
#define _ANSELF_ANSF7_POSITION                              0x7
#define _ANSELF_ANSF7_SIZE                                  0x1
#define _ANSELF_ANSF7_LENGTH                                0x1
#define _ANSELF_ANSF7_MASK                                  0x80

// Register: WPUF
#define WPUF WPUF
extern volatile unsigned char           WPUF                __at(0x1E51);
#ifndef _LIB_BUILD
asm("WPUF equ 01E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned WPUF0                  :1;
        unsigned WPUF1                  :1;
        unsigned WPUF2                  :1;
        unsigned WPUF3                  :1;
        unsigned WPUF4                  :1;
        unsigned WPUF5                  :1;
        unsigned WPUF6                  :1;
        unsigned WPUF7                  :1;
    };
} WPUFbits_t;
extern volatile WPUFbits_t WPUFbits __at(0x1E51);
// bitfield macros
#define _WPUF_WPUF0_POSN                                    0x0
#define _WPUF_WPUF0_POSITION                                0x0
#define _WPUF_WPUF0_SIZE                                    0x1
#define _WPUF_WPUF0_LENGTH                                  0x1
#define _WPUF_WPUF0_MASK                                    0x1
#define _WPUF_WPUF1_POSN                                    0x1
#define _WPUF_WPUF1_POSITION                                0x1
#define _WPUF_WPUF1_SIZE                                    0x1
#define _WPUF_WPUF1_LENGTH                                  0x1
#define _WPUF_WPUF1_MASK                                    0x2
#define _WPUF_WPUF2_POSN                                    0x2
#define _WPUF_WPUF2_POSITION                                0x2
#define _WPUF_WPUF2_SIZE                                    0x1
#define _WPUF_WPUF2_LENGTH                                  0x1
#define _WPUF_WPUF2_MASK                                    0x4
#define _WPUF_WPUF3_POSN                                    0x3
#define _WPUF_WPUF3_POSITION                                0x3
#define _WPUF_WPUF3_SIZE                                    0x1
#define _WPUF_WPUF3_LENGTH                                  0x1
#define _WPUF_WPUF3_MASK                                    0x8
#define _WPUF_WPUF4_POSN                                    0x4
#define _WPUF_WPUF4_POSITION                                0x4
#define _WPUF_WPUF4_SIZE                                    0x1
#define _WPUF_WPUF4_LENGTH                                  0x1
#define _WPUF_WPUF4_MASK                                    0x10
#define _WPUF_WPUF5_POSN                                    0x5
#define _WPUF_WPUF5_POSITION                                0x5
#define _WPUF_WPUF5_SIZE                                    0x1
#define _WPUF_WPUF5_LENGTH                                  0x1
#define _WPUF_WPUF5_MASK                                    0x20
#define _WPUF_WPUF6_POSN                                    0x6
#define _WPUF_WPUF6_POSITION                                0x6
#define _WPUF_WPUF6_SIZE                                    0x1
#define _WPUF_WPUF6_LENGTH                                  0x1
#define _WPUF_WPUF6_MASK                                    0x40
#define _WPUF_WPUF7_POSN                                    0x7
#define _WPUF_WPUF7_POSITION                                0x7
#define _WPUF_WPUF7_SIZE                                    0x1
#define _WPUF_WPUF7_LENGTH                                  0x1
#define _WPUF_WPUF7_MASK                                    0x80

